function [alm_test]=almanahReciver(PathToTheFileAlmanach)
%функци€ содержит данные альмонаха спутника св€зи - OSCAR - 13
%¬ход - любое значение
%¬ыход - структура данных содержащих альманах спутника
%при необходимости, альманах приемника, мен€ть здесь
%     alm_test.Lam    = 2.322003490145776;           %долгота восход€щего узла
%     alm_test.I      = 63.4;%0.00381591;           %наклонение [градусы]
%     alm_test.omegan = 4.712388980384690;%0.5233521;            %аргумент периге€ [градусы]
%     alm_test.E      = 0.740969;%0.7005292892;%0.5005292892;         %эксцентриситет
%     alm_test.a      = 26553.4;%39800;                %больша€ полуось
%     alm_test.tc     = 0;%34070.875;            %врем€ прохождени€ первого узла, с
    
    
%     HEO2 - ARN 40000
%     alm_test.Lam    =83.041 ;%103.041 %[град] - долгота восход€щего узла
%     alm_test.I      = 63.4;%[градусы] наклонение 
%     alm_test.omegan = 270;%[градусы] аргумент периге€ 
%     alm_test.E      = 0.740969;%  эксцентриситет
%     alm_test.a      = 26553.4;%39800;                %больша€ полуось
%     alm_test.tc     = 41425.8;%34070.875;            %врем€ прохождени€ первого узла, с
%     
    
% 41425.8 41425.0

%     HEO2 - ARN 80000
%     alm_test.Lam    = 83.041;%[град] - долгота восход€щего узла 63.041
%     alm_test.I      = 63.4;%[градусы] наклонение 
%     alm_test.omegan = 270;%[градусы] аргумент периге€ 
%     alm_test.E      =0.85249;%  эксцентриситет
%     alm_test.a      =46628.1;%                %больша€ полуось
%     alm_test.tc     = 98538.1;%34070.875;            %врем€ прохождени€ первого узла, с

    
%     GEO_dreyf
%     alm_test.Lam    = 70.2176;%[град] - долгота восход€щего узла 63.041
%     alm_test.I      = 0;%[градусы] наклонение 
%     alm_test.omegan = 0;%[градусы] аргумент периге€ 
%     alm_test.E      =0;%  эксцентриситет
%     alm_test.a      =41456.5+6378.136;%                %больша€ полуось
%     alm_test.tc     = 0;            %врем€ прохождени€ первого узла, с
    
%     LO
    alm_test.Lam    = 66.5567;%[град] - долгота восход€щего узла 63.041
    alm_test.I      = 10;%[градусы] наклонение 
    alm_test.omegan = 0;%[градусы] аргумент периге€ 
    alm_test.E      =0;%  эксцентриситет
    alm_test.a      =7378.14;%                %больша€ полуось
    alm_test.tc     = 0;            %врем€ прохождени€ первого узла, с
%     