%задаём систему ДУ для вычисления координат на момент времени Ti
function dy = d_State_Space_dT(t,y,Sun,Moon)

Ae=6378.136;%[км] - экваториальный радиус Земли
MuE=398600.4418;%[км^3/с^2] - константа гравитационного поля Земли
J2_0=1082625.75e-9;% - вторая зональная гармоника геопотенциала

r0=sqrt( ( y(1) )^2 +( y(2) )^2 + ( y(3) )^2 );
po=Ae/r0;

dy=zeros(6,1);

dy(1)=y(4);
dy(2)=y(5);
dy(3)=y(6);
dy(4)=-(MuE/r0^2)*(y(1)/r0) - 3/2*J2_0*(MuE/r0^2)*(y(1)/r0)*po^2*( 1-5*(y(3)/r0)^2 )+Sun(1)+Moon(1);
dy(5)=-(MuE/r0^2)*(y(2)/r0) - 3/2*J2_0*(MuE/r0^2)*(y(2)/r0)*po^2*( 1-5*(y(3)/r0)^2 )+Sun(2)+Moon(2);
dy(6)=-(MuE/r0^2)*(y(3)/r0) - 3/2*J2_0*(MuE/r0^2)*(y(3)/r0)*po^2*( 3-5*(y(3)/r0)^2 )+Sun(3)+Moon(3);