function [rin]=Rinex(PathToTheFileRinex);
%Функция для обработки Rinex-файлов. Формат - .14G
%Вход - путь к файлу
%Выход - структура rin

fid = fopen('E:/work/nii/генератор/data/MCCT0400.14G', 'r');    %RINEX

fseek(fid, 308, 'bof');                     %чтение файла начинаем с 308 символа
C = textscan(fid, '%f');                    %читаем файл как числа типа float
fclose(fid);                                %выгружаем файл

%============================CONSTANTS
rin.P1 = 30;                                    %[минут]


%============================ZEROS
rin.XVn = zeros(24*60/rin.P1,24);                       %Размер задаем размерность массива
rin.XAn = zeros(24*60/rin.P1,24);
rin.Xn  = zeros(24*60/rin.P1,24);
rin.YVn = zeros(24*60/rin.P1,24);
rin.YAn = zeros(24*60/rin.P1,24);
rin.Yn  = zeros(24*60/rin.P1,24);
rin.ZVn = zeros(24*60/rin.P1,24);
rin.ZAn = zeros(24*60/rin.P1,24);
rin.Zn  = zeros(24*60/rin.P1,24);

rin.tk = zeros(24*60/rin.P1,24);
rin.yn = zeros(24*60/rin.P1,24);
rin.tn = zeros(24*60/rin.P1,24);

%===========обработка структуры
for tb=1:(24*60/rin.P1)                           %Цикл формирования данных
    
    for i=1:6                                 %Цикл формирования даты
    
    rin.Nt(tb,i)  = C{1}(1+i+528*(tb-1));         %Данные:год/месяц/день/часы/минуты/секунды
    
    end
    
    for n=1:24
        
    rin.XVn(tb,n) = C{1}(12+528*(tb-1)+(n-1)*22);               %Координаты, Скорости, Ускорения X,Y,Z
    rin.XAn(tb,n) = C{1}(13+528*(tb-1)+(n-1)*22);               %1я цифра=номер цифры в ринес файле
    rin.Xn(tb,n)  = C{1}(11+528*(tb-1)+(n-1)*22);               %2я цифра=const - кол-во данных для каждого НС
                                                                %3я цифра=cons - кол-во НС
    rin.YVn(tb,n) = C{1}(16+528*(tb-1)+(n-1)*22);               %(a+b*c*(tb-1)= данные для тогоже НС но с различным сдвигом tb
    rin.YAn(tb,n) = C{1}(17+528*(tb-1)+(n-1)*22);               %(n-1)*b = сдвиг на n-й НС
    rin.Yn(tb,n)  = C{1}(15+528*(tb-1)+(n-1)*22);
    
    rin.ZVn(tb,n) = C{1}(20+528*(tb-1)+(n-1)*22);
    rin.ZAn(tb,n) = C{1}(21+528*(tb-1)+(n-1)*22);
    rin.Zn(tb,n)  = C{1}(19+528*(tb-1)+(n-1)*22);
    
    rin.En(tb,n)  = C{1}(22+528*(tb-1)+(n-1)*22);
    
    rin.Bn(tb,n)  = C{1}(14+528*(tb-1)+(n-1)*22);               %Пригодность НКА
    
    rin.tn(tb,n)  = C{1}(8+528*(tb-1)+(n-1)*22);                %Сдвиг часов
    
    rin.yn(tb,n)  = C{1}(9+528*(tb-1)+(n-1)*22);                %сдвиг частоты
    
    rin.tk(tb,n)  = C{1}(10+528*(tb-1)+(n-1)*22);                   %время от начала суток
        
    end
end
